In [2]:
import pandas as pd
df1=pd.DataFrame({
    "city":["delhi","banglore","mumbai"],
    "temperature":[30,25,29]
})
df1

       city  temperature
0     delhi           30
1  banglore           25
2    mumbai           29

In [3]:
df2=pd.DataFrame({
    "city":["delhi","banglore","mumbai"],
    "windspeed":[8,5,7]
})
df2

       city  windspeed
0     delhi          8
1  banglore          5
2    mumbai          7

In [ ]:
# if we want to merge data on the basis of city

In [5]:
df3=pd.merge(df1,df2,on="city")
df3

       city  temperature  windspeed
0     delhi           30          8
1  banglore           25          5
2    mumbai           29          7

In [ ]:
#lets we have two data but differnt city than how merge function work

In [6]:
df4=pd.DataFrame({
    "city":["delhi","banglore","mumbai"],
    "temperature":[30,25,29]
})
df4

       city  temperature
0     delhi           30
1  banglore           25
2    mumbai           29

In [12]:
df5=pd.DataFrame({
    "city":["new york","delhi","london","dubai"],
    "windspeed":[8,5,7,10]
})
df5

       city  windspeed
0  new york          8
1     delhi          5
2    london          7
3     dubai         10

In [13]:
pd.merge(df4,df5,on="city")  #by default it take intersection(the city which will be common in both the data it print it)of two data.

    city  temperature  windspeed
0  delhi           30          5

In [15]:
pd.merge(df4,df5,on="city",how="outer") #"outer" work as union of two data

       city  temperature  windspeed
0     delhi         30.0        5.0
1  banglore         25.0        NaN
2    mumbai         29.0        NaN
3  new york          NaN        8.0
4    london          NaN        7.0
5     dubai          NaN       10.0